УТ.РасширениеКонтурЛогистика/src/Enums/КонтурЛогистика_УровниДоступаСотрудника/КонтурЛогистика_УровниДоступаСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_УровниДоступаСотрудника</name>
  <comment>https://api-docs.diadoc.ru/ru/latest/proto/DocumentAccessLevel.html</comment>
  <enumValues>
    <name>UnknownDocumentAccessLevel</name>
  </enumValues>
  <enumValues>
    <name>DepartmentOnly</name>
  </enumValues>
  <enumValues>
    <name>DepartmentAndSubdepartments</name>
  </enumValues>
  <enumValues>
    <name>AllDocuments</name>
  </enumValues>
  <enumValues>
    <name>SelectedDepartments</name>
  </enumValues>
</mdclass:Enum>

УТ.РасширениеКонтурЛогистика/src/Enums/КонтурЛогистика_УровниДоступаСотрудника/ManagerModule.bsl
Функция КонвертироватьЗначениеИзДиадок(СтрокаУровняДоступаДиадок) Экспорт
	
	// https://api-docs.diadoc.ru/ru/latest/proto/DocumentAccessLevel.html
	
	Если СтрокаУровняДоступаДиадок = "UnknownDocumentAccessLevel" Тогда 
		Возврат UnknownDocumentAccessLevel;
	ИначеЕсли СтрокаУровняДоступаДиадок = "DepartmentOnly" Тогда 
		Возврат DepartmentOnly;
	ИначеЕсли СтрокаУровняДоступаДиадок = "DepartmentAndSubdepartments" Тогда 
		Возврат DepartmentAndSubdepartments;
	ИначеЕсли СтрокаУровняДоступаДиадок = "AllDocuments" Тогда 
		Возврат AllDocuments;
	ИначеЕсли СтрокаУровняДоступаДиадок = "SelectedDepartments" Тогда
		Возврат SelectedDepartments;
	Иначе
		Возврат ПустаяСсылка();	
	КонецЕсли;
	
КонецФункции
